{"inkVersion":20,"root":[[{"->":"Selector"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Selector":[["ev",{"VAR?":"CurrentStoryState"},0,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_1"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},1,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_2"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},2,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_3"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},3,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_4"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},4,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_5"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},5,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_6"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},6,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_7"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},7,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_8"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},8,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_9"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},9,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_10"},{"->":".^.^.^.12"},null]}],["ev",{"VAR?":"CurrentStoryState"},10,"==","/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"Day_11"},{"->":".^.^.^.12"},null]}],[{"->":".^.b"},{"b":["\n","^CurrentStoryState    11:","\n",{"->":"Extra"},"end",{"->":".^.^.^.12"},null]}],"nop","\n",{"#f":1}],"Day_1":["^Ah, well met!","\n","^My name is Florian. How nice it is to see a restaurant owner who takes the time to greet their guests.","\n","^And one with a ‘welcome in’ sign outside. Very... handy.. Ahem.","\n","^Well, I’m pleased to meet your acquaintance! I’m sure I’ll be stopping in here for a bite everyone once in a while.","\n","^A bite of... food, yes. Anyways. Thank you!","\n","done",{"#f":1}],"Day_2":[["^Hello again, friend!","\n","^How are you faring? You have an aura of confidence about you that I had not noticed on my visit prior.","\n","^It seems you have started to feel at home in this new business of yours, what a wonderful thing!","\n","^I felt a similar way a few months into my current job. I teach magic and history at the college up the road from here. Forty years since I started, if I remember correctly.","\n","^I was entirely overwhelmed at first. So much to learn in so little time! I have the knowledge, yes, but teaching it to sleepyheaded college students is another beast entirely.","\n","^And, yet, I found my footing somehow. But you always keep learning how to go about things better! I’ve spent a long time at my institution and have yet to fully master the art of teaching.","\n",["ev",{"^->":"Day_2.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Forty years is a long time.",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_2.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Four years is a long time.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","^... Aha-!! Yes, I suppose it is.","\n","^I’ve... I’ve been told I don’t look my age. I suppose it's a bit hard to tell.","\n","^I have a... very rigorous skincare routine.","\n","^... Ahem.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","^Oh, ahm.. Ahem. Off by a factor of ten, there.","\n","^Is it that hard to believe I’ve been at the institution for forty years?","\n","^... Perhaps that was a joke? Ah, I’m sorry.","\n","^... Anyways.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Thank you for the lovely chat. It’s quite pleasant talking to you.","\n","done",{"#f":5}]}],{"#f":1}],"Day_3":["^Ahem. Excuse me? Could I ask but a moment of your time?","\n","^A thousand apologies. I don’t mean to distract you from your work. I simply intend on frequenting this establishment, and as such I have a small accommodation to request.","\n","^I don’t know what all goes into every dish, but please refrain from adding garlic to anything I order. It's a... food allergy. Very severe. I’m sure you understand.","\n","^Thank you ever so much!","\n","^Oh, while I have you here, might I ask another question?","\n","^I am... ahem, not from here. Yes. And in my, er, hometown.. It is quite common to make soup dishes with Blood. You might feel your hairs stand on end hearing that, but it is not that abnormal.","\n","^I have not found a single establishment that serves a dish in that manner. If you’re looking to expand your menu, I recommend you look into it.","\n","^I would be willing to pay a premium for that sort of thing.","\n","^... Ahem. Yes, that is all. Good day.","\n","done",{"#f":1}],"Day_4":[["^... Yawn.","\n","^Ah... my apologies, I find myself quite tired in the daytime hours these days.","\n","^Ah- not for any particular reason! Perhaps I should simply go to sleep at an earlier hour. I relax in my study with a good book and the hours get away from me.","\n","^I used to sprinkle Fairy Dust into my meals. It has some magical properties, all the effects of caffeine without the unpleasant taste.","\n",["ev",{"^->":"Day_4.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Do you not like coffee?",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_4.0.9.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^What books do you like to read?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],"\n","^Mmm... it is not my favorite taste, no.","\n","^I much prefer a nice cup of tea. The aroma is much more preferable, and the taste is subtle. Coffee is blunt, it lacks elegance.","\n","^I meander the streets of our good town and see its corners filled with coffee houses.","\n","^I remember in my youth being able to visit a tea room whenever I pleased. Light meals and a more refined atmosphere. It’s a shame I can’t find the same today.","\n","^... Aha! I shouldn’t talk so. It serves only to age me.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_4.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.9.s"},[{"#n":"$r2"}],"\n","^Oh my... it’s a bit embarrassing, actually.","\n","^I used to spend my time with more academic works. I love to learn everything this world has to offer- but lately I find them a bit tiresome.","\n","^I work in academia, of course. I’m surrounded by it all my waking hours. So recently I’ve found myself becoming quite fond of... ahem. Romance novels.","\n","^It’s funny, really. I used to look down on others for reading those sorts of books, but I understand their appeal now. A sort of escapism.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Oh, look at me, prattling on again. I’ll leave you to your work.","\n","done",{"#f":5}]}],{"#f":1}],"Day_5":[["^...","\n","^... Oh... I’m sorry... I’m afraid I’m fighting my own battles today.","\n",["ev",{"^->":"Day_5.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^What’s wrong?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^Oh dear... I’m afraid I’ve kept an awful secret from you. It is my best kept secret, but it rips me apart inside to keep it from you...","\n",[["ev",{"^->":"Day_5.0.c-0.9.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^You’re a vampire?",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_5.0.c-0.9.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^You’re a werewolf?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_5.0.c-0.9.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^Wha!? How could it be, you knew all along?!","\n","^And yet... despite knowing my dark secret... you treated me as a friend all the same...","\n","^Sniff sniff.. Oh, I’m alright. I’m simply overcome with emotion.","\n",{"->":"Day_5.0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_5.0.c-0.9.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Excuse me?","\n","^No, no. I’m... ahem. A vampire.","\n","^Do I give the impression of someone who transforms into a large, hairy beast? Oh dear...","\n","^No, no. Werewolves are pack creatures. The path I walk is far more isolating.","\n",{"->":"Day_5.0.g-0"},{"#f":5}]}],{"#f":5}],"g-0":["^It’s quite a lonely thing. Many people would look upon me with fear or disgust for confessing such a thing.","\n","^The age of vampires has long since ended- my kind was hunted for sport some hundred years ago. Very few remain.","\n","^And, yet, by comparison I am a relatively young vampire. I was turned sixty years ago by one of the surviving vampires. And my life has not known the warmth of companionship since.","\n","^How difficult it is to foster a friendship with someone knowing you cannot be your true self around them- and, yet, it is just as impossible to be true when some may look at you with fear and disgust for a thing you cannot help.","\n","^... Oh, but I’ve said too much already. I hope you will still welcome me in your establishment all the same.","\n","^I do not hurt people, if you could even think such a thing of me to begin with. I’ve spent many years investigating an alternative to... the suspected diet of someone like me.","\n","^The food you serve is one of these solutions. It does not sustain me as much as.. Ahem. But it serves until I have to feed again.","\n","^Ack. What an awful thing to have to discuss. Please discard such mental images- they do not define me. I hope we can continue to be friends.","\n","done",{"#f":5}]}],{"#f":1}],"Day_6":["^... Sigh... I’m still feeling a bit melancholy today...","\n","^I have these bouts of loneliness. I hope I am not troubling you in talking about it. It’s seldom that I have someone close enough to talk about such a thing.","\n","^I had a partner before I was so cursed with this affliction. Once I realized what had become of myself I couldn’t bear to stay in such a relationship.","\n","^Was it fair? To watch the one you love grow old while you stay the same. My heart could not bear the thought, and so we drifted apart.","\n","^And yet, I find myself wondering if I made the right decision...","\n","done",{"#f":1}],"Day_7":[["^Hello again.","\n","^Try as I might, I cannot rid from my mind the thought that I may be going about my own life the wrong way.","\n","^For the last sixty years I’ve kept to myself, keeping my acquaintances at arms reach.","\n","^It’s incredibly difficult, you must understand. To know that all the bonds I make are only temporary- that I will outlive all the people who become dear to me.","\n","^But, now, I’ve isolated myself out of fear of losing someone. My only friend is you, truly.","\n","^If you consider me that?..","\n",["ev",{"^->":"Day_7.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Not really..",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_7.0.13.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Of course.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"\n","^Oh...","\n","^Well, maybe it was presumptuous of me to think you would consider me a friend.","\n","^We’ve only spoken in your restaurant, after all...","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_7.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.13.s"},[{"#n":"$r2"}],"\n","^Oh, goodness, it might not mean much for you to say but it means everything for me to hear.","\n","^Being able to talk to you these past days has opened my eyes, I think. Reminded me how nice it is to keep up with a friend, have an actual relationship...","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^I’ll continue to try to get to know you better. These visits to your restaurant have been a breath of fresh air.","\n","done",{"#f":5}]}],{"#f":1}],"Day_8":[["^Hello again, my friend!","\n","^I do so apologize for the way I have acted recently. I’m in much better spirits today.","\n","^Even better seeing you! I hope you have been faring well.","\n",["ev",{"^->":"Day_8.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^How is the school?",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_8.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^How did you become a vampire?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_8.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^Oh, as lovely as ever.","\n","^After our conversation last, I was feeling a bit more optimistic about the whole ‘getting to know people’ business.","\n","^I offered to buy coffee for my coworker and we spent the morning chatting. It was delightful.","\n","^... Well, until the sun peeked out from behind the clouds and I had to swiftly move to the other side of the table.","\n","^I brushed it off with grace, though! Claimed there was a bee attempting to ruin my day, he laughed it off.","\n","^I still feel bad not telling the whole truth, but... It’s progress. Perhaps soon I will be able to have that conversation with my peers.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_8.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n","^Oh, my... What a personal question...","\n","^Haha! I’m only joking. It’s a bit of a funny story, really.","\n","^I was trying to make a living as an artist. Although it was fulfilling, it was not the most profitable job.","\n","^With no place to call home, I took a job at a cemetery. The work was quiet and I was given board, I simply had to keep watch of the place.","\n","^Well, of course, I was terribly curious about some of the older structures. I ventured too far into one of them and discovered a coffin...","\n","^I’m sure you can guess what happened after. I had disturbed some old vampire who was in a state of hibernation, and he desired a meal after his long period of rest.","\n","^I’m not sure where he went off to...","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Oh, well. I’ll worry about that another time. Right now I’m taking in the lovely ambience of your store.","\n","^Thank you as always for your time!","\n","done",{"#f":5}]}],{"#f":1}],"Day_9":[["^Oh, my friend, I need your advice.","\n","^You’ve been nothing but helpful thus far, so I come to you with news...","\n","^My, ahm.. Partner, the one from before I became a vampire. He must have found my name through the school.","\n","^I arrived at work to find a letter addressed to me on my desk. It was an invitation to meet again over brunch.","\n","^Oh, what do I do? No doubt he’s aged all these years, but I’ll show up looking as young as the day I left him...","\n",["ev",{"^->":"Day_9.0.10.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Keep it a secret!",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_9.0.11.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Tell him the truth!",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_9.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.10.s"},[{"#n":"$r2"}],"\n","^Oh, that’s no good.","\n","^Keeping it a secret is exactly what got me into this trouble in the first place. I hardly think it would be advisable to continue down that route.","\n","^If I do end up going, I ought to be honest...","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_9.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.11.s"},[{"#n":"$r2"}],"\n","^Oh, you’re right, aren’t you?","\n","^It’s exactly what I need to be told, but it pains me to hear it all the same.","\n","^I can only hope he’ll forgive me, understand why I left the way I did...","\n","^I don’t think it can go back to the way it was, but perhaps we could still be friends.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^I need time to think it over... And a nice, warm meal.","\n","done",{"#f":5}]}],{"#f":1}],"Day_10":[["^Good day, friend.","\n","^I did end up going to meet my old partner after all.","\n","^I was up all night deliberating- well, you know, later than usual... I decided ultimately that hiding away would only continue to hurt the both of us.","\n",["ev",{"^->":"Day_10.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^How did it go?",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_10.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"\n","^I expected him to be angry with me. Understandably so, I left so suddenly, but...","\n","^...despite how I left, he told me he was happy to see me again. He welcomed me with open arms. We talked like no time had passed between us.","\n","^... Sniff sniff.","\n","^Oh, it's a wonderful thing to connect with others. I’m a fool for hiding myself away for so long.","\n","^But I shouldn’t despair, I’m in a much better place now, aren’t I? I have you as a friend, and I think that’s wonderful.","\n","done",{"#f":5}]}],{"#f":1}],"Day_11":[["^I bid you good day! What a momentous occasion- a full month! What a testament to your hard work and determination!","\n",["ev",{"^->":"Day_11.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Thank you! (affection ending)",{"->":"$r","var":true},null]}],["ev",{"^->":"Day_11.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Thank you! (neutral ending)",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Day_11.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^No, thank you.","\n","^I must remark that you have provided me with much more than simple meals.","\n","^In my endeavor to better connect with my fellow creatures, I would like to invite you to tea.","\n","^It would bring me much happiness to get to know you more outside of a restaurant setting. I hope that we can become good friends.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["ev",{"^->":"Day_11.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^Thank you!","\n","^You have brought joy to this community through the culinary arts.","\n","^I wish you the best of luck in all your future endeavors!","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],{"#f":1}],"Extra":["done",{"#f":1}],"Good_End":["done",{"#f":1}],"Bad_End":["done",{"#f":1}],"global decl":["ev",0,{"VAR=":"CurrentStoryState"},"/ev","end",null],"#f":1}],"listDefs":{}}